CATEGORIES = {

   "Программирование и IT": {
      "keywords": [
         "программир",
         "python",
         "java",
         "javascript",
         "c++",
         "c#",
         "backend",
         "frontend",
         "webdev",
         "алгоритм",
         "разработ",
         "код",
         "dev",
         "1с",
         "5g",
         "qa",
         "тестир",
         "devops",
         "git",
         "api",
         "автоматиз",
         "сетевой",
         "системн",
         "инженери",
         " ит",
         "it",
         "цифровые",
         "anylogic",
         
         
      ],
      "exceptions": [
         "hr",
         "финанс",
         "бизнес",
         "медицинский",
         "травмой",
         "терапия",
         "культура",
         "француз",
         "facility",
         "territorial",
         "acquisition"
         
      ]
   },

   "Искусственный интеллект": {
      "keywords": [
         " ии",
         "ии-",
         " ai",
         "искусственный интеллект",
         "искусственному интеллекту",
         "искусственного интеллекта",
         "нейро",
         "gpt",
         "llm",
         "машинн обуч",
         "machine learning",
         "ml",
         "deep learning",
         "генератив",
         "data science",
         "prompt",
         "вайб код",
         "вайб-код",
      ],
      "exceptions": ["врач", ]
   },

   "Data Science и аналитика": {
      "keywords": [
         "аналит",
         "data",
         "дашборд",
         "tableau",
         "power bi",
         "метрик",
         "unit эконом",
         "юнит эконом",
         " bi",
         "Математика",
         "анализ данных",
         "анализировать",
         "машинного обучения",
         "теория вероятностей",
      ],
      "exceptions": ["педагогич"]
   },

   "Дизайн": {
      "keywords": [
         "дизайн",
         "ux",
         "ui",
         "figma",
         "графич",
         "типограф",
         "adobe",
         "шрифт",
         "иллюстр",
         "креатив",
         "худож",
         "коммуникацион дизайн",
         "декор",
         "одежд",
         "сторителлинг",
         "инфограф",
         "стайлинг",
   
      ],
      "exceptions": ["выступление", "демограф"]
   },

   "3D и анимация": {
      "keywords": [
         "3d",
         "трехмер",
         "трёхмер",
         "cg",
         "cgi",
         "аним",
         "motion",
         "моушн",
         "vfx",
         "rig",
         "мульт",
         "blender",
         "maya",
         "houdini",
         "zbrush",
      ],
      "exceptions": []
   },

   "PR и маркетинг": {
      "keywords": [
         "маркетинг",
         "маркетп",
         "маркето",
         "smm",
         "seo",
         "бренд",
         "контент",
         "трафик",
         "таргет",
         "digital",
         "реклам",
         "продвиж",
         "копирайт",
         "медиакомм",
         "молодежные",
         "информационная открытость",
         
      ],
      "exceptions": ["автоматиз"]
   },

   "Менеджмент": {
      "keywords": [
         "менедж",
         "руковод",
         "директор",
         "защите информации",
         "управлен",
         "управляющ",
         "lead",
         "лидер",
         "mba",
         "мва",
         "executive",
         "project",
         "product",
         "scrum",
         "agile",
         "скрам",
         "триз",
         "показатели",
         "продюс",
         "трудовых споров",
         "эффективности команды",
         "сервисных",
         "вовлеч",
         "комплаенс",
         "корпоративный",
         "организационное",
         
      ],
      "exceptions": ["автоматиз"]
   },

   "Финансы и экономика": {
      "keywords": [
         "финанс",
         "эконом",
         "инвест",
         "банк",
         "бюджет",
         "бух",
         "казнач",
         "ipo",
         "фондов",
         "кредит",
         "тариф",
         "стоимост",
         "платы",
         "задолж",
         "международные",
         "международное",
         "международной",
         "стратегический анализ", 
         "анализ компаний", 
      ],
      "exceptions": []
   },

   "Налоги": {
      "keywords": [
         "налог",
         "tax",
         "фнс",
      ],
      "exceptions": []
   },

   "HR и управление персоналом": {
      "keywords": [
         "hr",
         "персонал",
         "кадр",
         "talent",
         "reward",
         "рекрут",
         "мотивац",
      ],
      "exceptions": ["бренд", ]
   },

   "Soft Skills": {
      "keywords": [
         "коммуник",
         "переговор",
         "оратор",
         "выступл",
         "конфликт",
         "эмоц",
         "стресс",
         "тайм",
         "успех",
         "личной эффективности",
         "повышения эффективности",
         "soft skill",
         "фасилитац",
         "критическ мышлен",
         "лидерств",
         "цели",
         "life",
         "мышление",
         "работодатели",
         "текстом",
         "медиац",
         "чтение",
         "фактчек",
         "блог",
      ],
      "exceptions": [
         "медиакоммун",
      ]
   },

   "Госуправление": {
      "keywords": [
         "госуд",
         "муницип",
         "теплоснабж",
         "гражданск служб",
         "коррупц",
         "госуправ",
         "госпаблик",
         "власти",
         "нпа",
         "территориального развития",
         "электронного документооборота",
         "архивного дела",
         "госслуж",
         "природоресурсный",
         "урбанистика",
         "депутат",
         "преступность",
         "ценност",
         "многоквартирных",
         "расчет платы",
         "старение",
         "эффективный gr",
      ],
      "exceptions": []
   },

   "Закупки и тендеры": {
      "keywords": [
         "закуп",
         "тендер",
         "фз",
         "фз",
         "госзаказ",
         "постав",
      ],
      "exceptions": []
   },
   
   "Стандартизация и метрология": {
      "keywords": [
         "соответств",
         "органолепт",
         "аттестац",
         "инспекц",
         "стандартных образцов",
         "метролог",
         "проб ",
         "калибровка средств",
      ],
      "exceptions": []
   },

   "Юриспруденция и право": {
      "keywords": [
         "право",
         "права",
         "юрист",
         "юрисп",
         "юридич"
         "адвокат",
         "адвокатов",
         "арбитраж",
         "договор",
         "compliance",
         "банкрот",
         "судеб",
         "нормативные акты",
         "делопроизводство",
         "контракт",
         "закона",
         "законо",
         "санкц",
         "экспертиза",
         "задолж",
         "юридических",
      ],
      "exceptions": ["управ", "психологич", 
      ]
   },

   "Педагогика": {
      "keywords": [
         "преподав",
         "педагог",
         "образов",
         "обучающ",
         "егэ",
         "учител",
         "обучен",
         "школ",
         "универс",
         "абитуриент",
         "методист",
         "изучен",
         "обществознан",
         "дефектолог",
         "логопедия",
         "работе с детьми",
         
      ],
      "exceptions": ["excel", "оружием","имуществ", "разработка",
                     "теплоснабжения","ценообразован", "муниципальным" ]
   },

   "Филалогия": {
      "keywords": [
         "перевод",
         "язык",
         "language",
         
      ],
      "exceptions": ["программи", "java", "право", ]
   },

   "Психология": {
      "keywords": [
         "психолог",
         "психоанализ",
         "психопатол",
         "терап",
         "эмоц",
         "травм",
         "сексолог",
         "психиатр",
         "группового анализа",
         "люб",
         "кст ",
         "нарцис",
         "гармони",
         "супружеской",
         "манипуляции", 
         "миланском подходе", 
         "оркт", 
      ],
      "exceptions": []
   },

   "Медицина и здоровье": {
      "keywords": [
         "медицин",
         "фарма",
         "здравоох",
         "здоров",
         "реабилит",
         "клиник",
         "биомед",
         "генет",
         "нутриц",
         "хелс",
         "биопсия",
         "врач",
         "кров",
         "лечения",
         "иммунология",
         "психопатол",
         "эстетист",
         "диетолог",
         "первой помощи",
      ],
      "exceptions": ["талантов"]
   },

   "Компьютерная грамотность": {
      "keywords": [
         "excel",
         "office",
         "word",
         "powerpoint",
         "компьют",
         "цифров грамот",
         "google docs",
         "google таблиц",
         "информационные технологии",
      ],
      "exceptions": []
   },

   "Бизнес и предпринимательство": {
      "keywords": [
         "бизнес",
         "предприним",
         "стартап",
         "коммерц",
         "ecommerce",
         "e commerce",
         "масштаб",
         "двойник",
         "делового администрирования",
      ],
      "exceptions": []
   },

   "Логистика": {
      "keywords": [
         "логист",
         "цепями постав",
         "supply chain",
         "склад",
         "достав",
         "тамож",
      ],
      "exceptions": ["соответствия"]
   },

   "Строительство и недвижимость": {
      "keywords": [
         "строит",
         "девелоп",
         "недвиж",
         "facility",
         "bim",
         "архитект",
      ],
      "exceptions": []
   },

   "Туризм и экскурсии": {
      "keywords": [
         "туризм",
         "экскурс",
         "гид",
         "краевед",
      ],
      "exceptions": []
   },

   "Охрана и безопасность": {
      "keywords": [
         "охран",
         "оруж",
         "детектив",
         "гостайн",
         "государственн тайн",
         "чоп",
         "террор",  
         "оператор беспилотного",  
      ],
      "exceptions": []
   },

   "Искусство и творчество": {
         "keywords": [
            "искусство",
            "искусства",
            "искусств",
            "творчество",
            "творческим экзаменам",
         ],
         "exceptions": ["управления", "оратор", "оценки", "бизнес", "речи", "договоров", ]
      },

   "DIY и хобби": {
      "keywords": [
         "швей",
         "растен",
         "fdm",
         "3d печат",
         "рукодел",
         "craft",
         "diy",
         "руками",
         "манга",
         "дидже",
         "генеалог",
      ],
      "exceptions": []
   },
   
   "Медиа и кинопроизводство": {
      "keywords": [
         "кино",
         "режиссер",
         "сценарист",
         "подкаст",
         "публикационного",
         "продакшн",
         "фотограф",
         "музыка",
         "телеведущий",
   
      ],
      "exceptions": ["музыкальные", ]
   },
   
   "Физическая культура и спорт": {
      "keywords": [
         "фитнес",
         "спорт",
            
      ],
      "exceptions": ["нефти"]
   },

   "Торговря и продажи": {
      "keywords": [
         "продаж",
         "торг",
         "селлер",
         "перегов"
      ],
      "exceptions": []
   },
   
   "Наука": {
      "keywords": [
         "химическ",
         "научных",
         "науки",
         "научного",
         "научно-произв",
         "академическое",
         "научно-тех",
         "научной",
         "кубсат",
         "квантовые",
         
      ],
      "exceptions": ["биохакинг"]
   },
   
   "Рабочие профессии": {
      "keywords": [
         " водителей",
         "моляры",
      ],
      "exceptions": ["биохакинг"]
   },

}


SUBCATEGORIES = {
   # Программирование и IT
   "Python": {
      "category": "Программирование и IT",
      "keywords": ["python", "python-"],
      "exceptions": []
   },
   "Кибербезопасность": {
      "category": "Программирование и IT",
      "keywords": ["кибербезоп", "mitre","информационной безопасности", "информационная безопасность",],
      "exceptions": []
   },
   "1С": {
      "category": "Программирование и IT",
      "keywords": ["1с", "1 c", "1c", "1c-", "1с-"],
      "exceptions": []
   },
   "Frontend": {
      "category": "Программирование и IT",
      "keywords": ["frontend", "react", "vue", "angular", "html",
                   " сайт",],
      "exceptions": []
   },
   "Backend": {
      "category": "Программирование и IT",
      "keywords": ["backend", "django", "flask", "fastapi", "spring"],
      "exceptions": []
   },
   "SQL": {
      "category": "Программирование и IT",
      "keywords": ["sql", "spring"],
      "exceptions": []
   },
   "Data Science": {
      "category": "Искусственный интеллект",
      "keywords": ["data science", "ml", "машинн обуч", "дата"],
      "exceptions": []
   },
   
   # Искусственный интеллект 
   "Нейросети": {
      "category": "Искусственный интеллект",
      "keywords": ["нейрос", "gpt", "llm"],
      "exceptions": []
   },
   
   
   #Аналитика
   
   
   # Дизайн
   "UX/UI": {
      "category": "Дизайн",
      "keywords": ["ux", "ui", "figma"],
      "exceptions": []
   },
   "Графический дизайн": {
      "category": "Дизайн",
      "keywords": ["графич", "типограф", "шрифт"],
      "exceptions": []
   },
   
   # 3D и анимация
   "3D-моделирование": {
      "category": "3D и анимация",
      "keywords": ["3d", "трехмер", "трёхмер", "blender",
                   "maya", "zbrush", "cgi", "nanocad"],
      "exceptions": []
   },
   "Анимация": {
      "category": "3D и анимация",
      "keywords": ["аним", "motion", "моушн", "vfx"],
      "exceptions": []
   },
   
   
   # PR и маркетинг
   "Интернет-маркетинг": {
      "category": "PR и маркетинг",
      "keywords": ["smm", "seo", "таргет", "digital"],
      "exceptions": []
   },
   "Брендинг": {
      "category": "PR и маркетинг",
      "keywords": ["бренд"],
      "exceptions": []
   },
   
   
   # Менеджмент
   "Проектный менеджмент": {
      "category": "Менеджмент",
      "keywords": ["project", "scrum", "agile", "проект"],
      "exceptions": []
   },
   "Продакт-менеджмент": {
      "category": "Менеджмент",
      "keywords": ["product", "продакт"],
      "exceptions": []
   },
   
   
   # Филология
   "Языки и перевод": {
      "category": "Филалогия",
      "keywords": [
         "англий",
         "китай",
         "турец",
         "араб",
         "француз",
         "русски",
         "gmat",
         "сст ",
         "toefl",
      ],
      "exceptions": ["право", "бизнес"]
   },
   "Литература": {
      "category": "Филалогия",
      "keywords": [
         "литерат",
         "писат",

      ],
      "exceptions": ["право",]
   },
   
   
   # HR и управление персоналом
   "HR": {
      "category": "HR и управление персоналом",
      "keywords": ["hr", "персонал", "кадр"],
      "exceptions": []
   },
   
   
   # Компьютерная грамотность
   "Excel": {
      "category": "Компьютерная грамотность",
      "keywords": ["excel"],
      "exceptions": []
   },
   
   
   # Soft Skills
   "Ораторское искусство": {
      "category": "Soft Skills",
      "keywords": ["оратор", "выступ", "реч", "спикер", 
                   "презентац", "переговор", ],
      "exceptions": ["дизайн", "лаборат"
      ]
   },
   "Тайм-менеджмент": {
      "category": "Soft Skills",
      "keywords": ["тайм", "стресс", "эмоц"],
      "exceptions": []
   },
   "Карьера": {
      "category": "Soft Skills",
      "keywords": ["карьер", "охотиться", "фриланс","призвания", "рофориенталог", "старт работы"
                   ],
      "exceptions": ["руководитель", "врача", "безопасности",
                     "научной", "центрами"]
   },
   "Коучинг": {
      "category": "Soft Skills",
      "keywords": ["коуч"
                   ],
      "exceptions": ["бизнес", "хелс", "иностранных",
                     "центрами"]
   },
   
   
   # Закупки и тендеры
   "Закупки": {
      "category": "Закупки и тендеры",
      "keywords": ["закуп", "тендер", "44 фз", "223 фз"],
      "exceptions": []
   },
   
   
   # Госуправление
   "Госслужба": {
      "category": "Госуправление",
      "keywords": ["госслуж", "муницип", "госуправ"],
      "exceptions": []
   },
   
   
   # Налоги
   "Налогообложение": {
      "category": "Налоги",
      "keywords": ["налог", "tax"],
      "exceptions": []
   },
   
   
   # Физическая культура и спорт
   "Йога": {
      "category": "Физическая культура и спорт",
      "keywords": ["йог"],
      "exceptions": []
   },
   
   
   # Наука
   "Философия": {
      "category": "Наука",
      "keywords": ["философ"],
      "exceptions": ["предпринимат", ]
   },
   "История": {
      "category": "Наука",
      "keywords": ["истор", "древн"],
      "exceptions": ["манга", "генеалогия", ]
   },
}