CATEGORIES = {
   "Программирование и IT": {
      "keywords": [
         "программир",
         "javascript",
         "c++",
         "c#",
         "облачных сервисов",
         "webdev",
         "алгоритм",
         "разработ",
         "код",
         "unix",
         "dev",
         "1с",
         "5g",
         "автоматиз",
         "сетевой",
         "системн",
         "инженери",
         " ит",
         "it",
         "цифровые",
         "anylogic",
         "основы математики",     
         "информационных систем",     
         "библиотечные системы", 
      ],
      "exceptions": [
         "hr",
         "финанс",
         "бизнес",
         "медицинский",
         "травмой",
         "терапия",
         "культура",
         "француз",
         "facility",
         "territorial",
         "acquisition"
         
      ]
   },

   "Искусственный интеллект": {
      "keywords": [
         " ии",
         "ии-",
         " ai",
         "искусственный интеллект",
         "искусственному интеллекту",
         "искусственного интеллекта",
         "llm",
         "нейросет",
         "машинн обуч",
         "генератив",
         "data science",
         "вайб-код",
      ],
      "exceptions": []
   },

   "Data Science и аналитика": {
      "keywords": [
         "аналит",
         "data",
         "дашборд",
         "tableau",
         "power bi",
         "метрик",
         "инженер данных",
         "unit эконом",
         "юнит эконом",
         " bi",
         "Математика",
         "анализ данных",
         "анализе данных",
         "анализа данных",
         "базы данных",
         "база данных",
         "анализировать",
         "машинного обучения",
         "теория вероятностей",
      ],
      "exceptions": ["педагогич"]
   },

   "Дизайн": {
      "keywords": [
         "дизайн",
         "типограф",
         "арт‑дирекшн",
         "adobe",
         "шрифт",
         "креатив",
         "худож",
         "декор",
         "одежд",
         "инфограф",
         "стайлинг",
         "арт-дир",
      ],
      "exceptions": ["выступление", "демограф"]
   },

   "3D и анимация": {
      "keywords": [
         "3d",
         "трехмер",
         "трёхмер",
         "cg",
         "cgi",
         "аним",
         "motion",
         "моушн",
         "vfx",
         "rig",
         "мульт",
         "blender",
         "maya",
         "houdini",
         "zbrush",
         "рабочий график",
      ],
      "exceptions": []
   },

   "PR и маркетинг": {
      "keywords": [
         "маркетинг",
         "маркетп",
         "маркето",
         " pr ",
         "pr ",
         " pr",
         "трафик",
         "ранжирование",
         "реклам",
         "продвиж",
         "медиакомм",
         "молодежные",
         "информационная открытость",
         
      ],
      "exceptions": ["автоматиз"]
   },

   "Менеджмент": {
      "keywords": [
         "менедж",
         "защите информации",
         "управлен",
         "инклюзия в циф",
         "lead",
         "лидер",
         "триз",
         "показатели",
         "продюс",
         "трудовых споров",
         "деловых пис",
         "сервисных",
         "вовлеч",
         "комплаенс",
         "корпоративный",
         "организационное",
         
      ],
      "exceptions": ["автоматиз"]
   },

   "Финансы и экономика": {
      "keywords": [
         "финанс",
         "эконом",
         "банк",
         "бюджет",
         "казнач",
         "фондов",
         "кредит",
         "тариф",
         "стоимост",
         "платы",
         "международные",
         "международное",
         "международной",
         "международных",
         "стратегический анализ", 
         "анализ компаний", 
      ],
      "exceptions": ["mba"]
   },

   "HR и управление персоналом": {
      "keywords": [
         "hr",
         "персонал",
         "кадр",
         "talent",
         "reward",
         "рекрут",
         "мотивац",
      ],
      "exceptions": ["бренд", ]
   },

   "Soft Skills": {
      "keywords": [
         "коммуник",
         "конфликт",
         "soft skill",
         "фасилитац",
         "критическ мышлен",
         "life",
         "мышление",
         "текстом",
         "нейролингв",
         "медиац",
         "медиат",
         "чтение",
         "фактчек",
         "блог",
         "этикет",
      ],
      "exceptions": ["медиакоммун",]
   },

   "Госуправление": {
      "keywords": [
         "госуд",
         "муницип",
         "теплоснабж",
         "коррупц",
         "госпаблик",
         "гражданской",
         "межконфессиональные",
         "власти",
         "нпа",
         "территориального развития",
         "электронного документооборота",
         "работы с населением ", 
         "работа с населением ", 
         "архивного дела",
         "природоресурсный",
         "урбанистика",
         "преступность",
         "ценност",
         "многоквартирных",
         "расчет платы",
         "старение",
         "эффективный gr",
         "работы с молодежью",
         "грамотности населения",
      ],
      "exceptions": []
   },

   "Закупки и тендеры": {
      "keywords": [
         "закуп",
         "тендер",
         "госзаказ",
         "постав",
      ],
      "exceptions": []
   },
   
   "Стандартизация и метрология": {
      "keywords": [
         "соответств",
         "органолепт",
         "аттестац",
         "аудитор",
         "инспекц",
         "стандартных образцов",
         "метролог",
         "проб ",
         "калибровка средств",
         "пищевой продукции",
      ],
      "exceptions": []
   },

   "Юриспруденция и право": {
      "keywords": [
         "право",
         "права",
         "юрист",
         "страхов",
         "юрисп",
         "имуществ",
         "юридич"
         "адвокат",
         "преступления",
         "оценочная деятельность",
         "арбитраж",
         "договор",
         "compliance",
         "нотар",
         "протокольн",
         "судеб",
         "интеллектуальная собственность",
         "нормативные акты",
         "делопроизводство",
         "контракт",
         "закона",
         "законо",
         "санкц",
         "экспертиза",
         "юридических",
         "кадаст",
      ],
      "exceptions": ["управ", "психологич", 
      ]
   },

   "Педагогика": {
      "keywords": [
         "преподав",
         "педагог",
         "учебник",
         "образов",
         "обучающ",
         "обучен",
         "дошкол",
         "учебного",
         "методист",
         "изучен",
         "обществознан",
         "проблемы этики",
         
      ],
      "exceptions": ["excel", "оружием","имуществ", "разработка",
                     "теплоснабжения","ценообразован", "муниципальным", "машинное"]
   },

   "Филалогия": {
      "keywords": [
         "перевод",
         "язык",
         "language",
         
      ],
      "exceptions": ["программи", "java", "право", ]
   },

   "Психология": {
      "keywords": [
         "нарцис",
         "гармони",
         "супружеской",
         "манипуляции", 
         " кст",
      ],
      "exceptions": []
   },

   "Медицина и здоровье": {
      "keywords": [
         "медицин",
         "клинич",
         "пациент",
         "здравоох",
         "здоров",
         "реабилит",   
         "поражен",
         "заболева",
         "уродинам",
         "патолог",
         "избранные вопросы",
         "актуальные вопросы",
         "клиник",
         "биомед",
         "генет",
         "психофиз",
         "хелс",
         "нефролитотрип",            
         "лечение",
         "остеопат", 
         "гинекол", 
         "эндо",
         "аллерг",
         "коррекционные",
         "врач",
         "лечения",
         "иммунолог",
         "психопатол",
         "эстетист",
         "первой помощи",
      ],
      "exceptions": ["талантов"]
   },

   "Компьютерная грамотность": {
      "keywords": [
         "компьют", 
         "таблиц", 
         "цифров грамот", 
         "цифровая грамотност",
         "информационные технологии",
      ],
      "exceptions": []
   },

   "Бизнес и предпринимательство": {
      "keywords": [
         "бизнес", 
         "предприним", 
         "коммерц", 
         "масштаб", 
         "двойник", 
         "mba",
         "от гипотезы к рынку",
      ],
      "exceptions": []
   },

   "Логистика": {
      "keywords": [
         "логист", 
         "трансфертн",
         "постав",
         "supply chain",
         "склад",
         "достав",
         "тамож",
      ],
      "exceptions": ["соответствия"]
   },

   "Строительство и недвижимость": {
      "keywords": [
         "строит", 
         "facility",
         "bim",
         "архитект",
         "renga",           
         "газораспределения", 
         "теплогазоснабжение", 
         "электроэнергетика", 
         "вентиляц", 
         "дорог", 
         "стройконтроль", 
      ],
      "exceptions": []
   },

   "Туризм и экскурсии": {
      "keywords": [
         "туризм",
         "экскурс",
         "гид ",
         "краевед",
      ],
      "exceptions": ["гидро"]
   },

   "Охрана и безопасность": {
      "keywords": [
         "охран",
         "оруж",
         "детектив",
         "гостайн",
         "государственн тайн",
         "чоп",
         "террор",  
         "аварийност",  
         "радиац",  
         "экологической безопасности",  
         "экологическая безопасности",  
         "оператор беспилотного",  
         "приказ 117",  
         "безопасность труда",  
         "безопасности объекта",  
      ],
      "exceptions": []
   },

   "DIY и хобби": {
      "keywords": [
         "растен",
         "fdm",
         "3d печат",
         "цветоч",
         "эпоксид",
         "craft",
         "валяние шерсти",
         "манга",
         "дидже",
         "генеалог",
      ],
      "exceptions": []
   },
   
   "Медиа и кинопроизводство": {
      "keywords": [
         "кино",
         "режиссер",
         "сценарист",
         "подкаст",
         "журналистика",
         "публикационного",
         "продакшн",
         "телеведущий",
   
      ],
      "exceptions": ["музыкальные", ]
   },
   
   "Физическая культура и спорт": {
      "keywords": [
         "спорт",
         "фитнес",
         "физическая культура"
      ],
      "exceptions": ["нефти", "транспорт"]
   },

   "Торговря и продажи": {
      "keywords": [
         "продаж",
         "торг",
         "селлер",
         "перегов",
         "сбыт"
      ],
      "exceptions": []
   },
   
   "Наука": {
      "keywords": [
         "научных",
         "науки",
         "науке",
         "научного",
         "наукоемкие",
         "научно-произв",
         "академическое",
         "научно-тех",
         "научной",
         "гистологич",
         "археологич",
         "метаболом",
         "cтатистический анализ",
         "искусство",
         "искусства",
         "искусств ",
         "творчество",
         "творческим экзаменам",
      ],
      "exceptions": ["управления", "оратор", "оценки", "бизнес", "речи", "договоров",]
   },
   
   "Рабочие профессии": {
      "keywords": [
         "водител",
         "реставрац",
         "обслуживание",
         "слесарь",
         "эколог ",
         "экология ",
         "обслуживание",
         "разряд",  
         "паназия",
         "судов",
         "лоцман",
         "швартовных",
         "ремонт электрооборудования",
         "пожар",
         "нефтегаз",
         " производство",
         "беспилотных",
         "бармен",
         "инженерно-техническое",
         "сборщик",
         "дезинфек",
      ],
      "exceptions": ["биохакинг", "руковододит",]
   },
   
   "Другое": {
      "keywords": [
         "пробный урок",
         "глобальном мире",
         "внешнеполит",
         "исследования скважин",
         "трудноизвлекаемых",
         "планировка квартиры",
         "proвино",
      ],
      "exceptions": []
   },

}


SUBCATEGORIES = {
   
   # Программирование и IT
   "Python": {
      "category": "Программирование и IT",
      "keywords": ["python", "питон"],
      "exceptions": []
   },
   "Java": {
      "category": "Программирование и IT",
      "keywords": ["java", "джава"],
      "exceptions": []
   },
   "Кибербезопасность": {
      "category": "Программирование и IT",
      "keywords": ["кибербезоп", "mitre","информационной безопасности", "информационная безопасность", "сетевая безопасность"],
      "exceptions": []
   },
   "1С": {
      "category": "Программирование и IT",
      "keywords": ["1с", "1 c", "1c", "1c-", "1с-"],
      "exceptions": []
   },
   "Frontend": {
      "category": "Программирование и IT",
      "keywords": ["frontend", "react", "vue", "angular", "html",
                   " сайт",],
      "exceptions": []
   },
   "Backend": {
      "category": "Программирование и IT",
      "keywords": ["backend", "django", "flask", "fastapi", "spring"],
      "exceptions": []
   },
   "SQL": {
      "category": "Программирование и IT",
      "keywords": ["sql", "spring"],
      "exceptions": []
   },
   "Go": {
      "category": "Программирование и IT",
      "keywords": ["go" ],
      "exceptions": ["язык", "django"]
   },
   "DevOps": {
      "category": "Программирование и IT",
      "keywords": ["devops", "sre ", "git"],
      "exceptions": []
   },
   "QA и тестирование": {
      "category": "Программирование и IT",
      "keywords": ["qa", "тестир"],
      "exceptions": []
   },
   "Data Science": {
      "category": "Искусственный интеллект",
      "keywords": ["data science", "ml", "машинн обуч", "дата"],
      "exceptions": []
   },
   
   
   # Искусственный интеллект 
   "Машинное обучение": {
      "category": "Искусственный интеллект",
      "keywords": ["машинное", "ml", "deep learning",  ],
      "exceptions": ["html", ]
   },
   
   
   # Data Science и аналитика
   
   
   # Дизайн
   "UX/UI": {
      "category": "Дизайн",
      "keywords": ["ux", "ui", "figma"],
      "exceptions": []
   },
   "Графический дизайн": {
      "category": "Дизайн",
      "keywords": ["графич", "типограф", "шрифт", "иллюстр","график",],
      "exceptions": []
   },
   
   
   # 3D и анимация
   "3D-моделирование": {
      "category": "3D и анимация",
      "keywords": ["3d", "трехмер", "трёхмер", "blender",
                   "maya", "zbrush", "cgi", "nanocad"],
      "exceptions": []
   },
   "Анимация": {
      "category": "3D и анимация",
      "keywords": ["аним", "motion", "моушн", "vfx"],
      "exceptions": []
   },
   
   
   # PR и маркетинг
   "Интернет-маркетинг": {
      "category": "PR и маркетинг",
      "keywords": ["smm", "seo", "таргет", "digital"],
      "exceptions": []
   },
   "Брендинг": {
      "category": "PR и маркетинг",
      "keywords": ["бренд"],
      "exceptions": []
   },
   "Копирайтинг и контент": {
      "category": "PR и маркетинг",
      "keywords": ["контент", "копирайт",],
      "exceptions": []
   },
   
     
   # Менеджмент
   "Проектный менеджмент": {
      "category": "Менеджмент",
      "keywords": ["project", "scrum", "скрам", "agile", "проект"],
      "exceptions": []
   },
   "Продакт-менеджмент": {
      "category": "Менеджмент",
      "keywords": ["product", "продакт"],
      "exceptions": []
   },
   "MBA": {
      "category": "Менеджмент",
      "keywords": ["mba", "мва", "executive"],
      "exceptions": []
   },
   "Лидерство": {
      "category": "Менеджмент",
      "keywords": ["лидер"],
      "exceptions": []
   },
   "Управление людьми": {
      "category": "Менеджмент",
      "keywords": ["директор","руковод", "заведущ", "управляющ", "эффективности команды", ],
      "exceptions": []
   },
   
   
   # Финансы и экономика
   "Налоги": {
      "category": "Финансы и экономика",
      "keywords": [
         "налог",
         "tax",
         "фнс",
         "задолж",
      ],
      "exceptions": []
   },
   "Инвестиции": {
      "category": "Финансы и экономика",
      "keywords": [
         "инвест",
         "ipo",
         "ценных бумаг",
         "оценка рынка",
      ],
      "exceptions": []
   },
   "Бухгалтерия": {
      "category": "Финансы и экономика",
      "keywords": ["бухг"],
      "exceptions": []
   },
   
   
   # HR и управление персоналом
   "HR": {
      "category": "HR и управление персоналом",
      "keywords": ["hr", "персонал"],
      "exceptions": []
   },
   
   
    # Soft Skills
   
   
   # Soft Skills
   "Ораторское искусство": {
      "category": "Soft Skills",
      "keywords": ["оратор", "выступ", "реч", "спикер", "презентац", "переговор"],
      "exceptions": ["дизайн", "лаборат"]
   },
   "Тайм-менеджмент": {
      "category": "Soft Skills",
      "keywords": ["тайм", "стресс", "эмоц"],
      "exceptions": []
   },
   "Карьера": {
      "category": "Soft Skills",
      "keywords": [
         "карьер", 
         "охотиться", 
         "фриланс",
         "призвания",     
         "рофориенталог", 
         "старт работы", 
         "резюме", 
         "профориентац", 
         "какую профессию"
         "работодатели",
         "личной эффективности",
         "повышения эффективности",

      ],
      "exceptions": ["руководитель", "врача", "безопасности", "научной", "центрами"]
   },
   "Коучинг": {
      "category": "Soft Skills",
      "keywords": ["коуч"],
      "exceptions": ["иностранных", "центрами"]
   },
   
    
   # Госуправление
   "Госслужба": {
      "category": "Госуправление",
      "keywords": ["госслуж", "муницип", "госуправ", "депутат",],
      "exceptions": []
   },
      
   
   # Закупки и тендеры
   "Закупки": {
      "category": "Закупки и тендеры",
      "keywords": ["закуп", "тендер", "фз"],
      "exceptions": []
   },
   
   
   # Стандартизация и метрология
   "Подтверждение соответствия ": {
      "category": "Стандартизация и метрология",
      "keywords": ["подтверждение соответств",],
      "exceptions": []
   },
   
   
   # Юриспруденция и право
   "Финансовое право": {
      "category": "Юриспруденция и право",
      "keywords": [         
         "задолж",
         "банкрот",

      ],
      "exceptions": []
   },
   
   
   # Педагогика
   "Подготовка к ОГЭ и ЕГЭ": {
      "category": "Педагогика",
      "keywords": ["егэ", "огэ"],
      "exceptions": []
   },
   "Дошкольное и детское образование": {
      "category": "Педагогика",
      "keywords": ["работе с детьми", "работы с детьми", "работа с детьми", "дефектолог", "логопед", "звукопроизношения", "вожат" "дошкольн"],
      "exceptions": []
   },
   "Школьное образование": {
      "category": "Педагогика",
      "keywords": ["школьник", "учител", "социализацию детей", "средней школе", 
],
      "exceptions": []
   },
   "Высшее образование": {
      "category": "Педагогика",
      "keywords": ["универс", "абитуриент"],
      "exceptions": []
   },
   
   
   # Филология
   "Языки и перевод": {
      "category": "Филалогия",
      "keywords": [
         "англий",
         "китай",
         "турец",
         "араб",
         "француз",
         "русски",
         "gmat",
         "сст ",
         "toefl",
         "трки",
         "иностранных граждан",
         "язык",
         "language",
      ],
      "exceptions": ["право", "бизнес", "программи", "java",]
   },
   "Литература": {
      "category": "Филалогия",
      "keywords": [
         "литерат",
         "писат",

      ],
      "exceptions": ["право",]
   },

   
   # Психология
   "Психология": {
      "category": "Психология",
      "keywords": [
         "психол",   
         "сексолог",
         "гармони",
         "супружеской",
         "люб", 
      ],
      "exceptions": []
   },
   "Психотерапия": {
      "category": "Психология",
      "keywords": ["терап", "травм", "группового анализа", "миланском подходе", "оркт"],
      "exceptions": []
   },
   "Клиническая психология": {
      "category": "Психология",
      "keywords": [
         "психопатол", 
         "суицид", 
         "психиатр", 
         "профайлинг",
         "полиграф",
         "психоанализ",

      ],
      "exceptions": []
   },
 
   
   # Медицина и здоровье
   "Хирургия": {
      "category": "Медицина и здоровье",
      "keywords": ["хирург", "резекц", "операционное дело"],
      "exceptions": []
   },
   "Кардиология": {
      "category": "Медицина и здоровье",
      "keywords": ["серд", "кардио", "кров"],
      "exceptions": []
   },
   "Онкология": {
      "category": "Медицина и здоровье",
      "keywords": ["онколог", "биопсия"],
      "exceptions": []
   },
   "Педиатрия": {
      "category": "Медицина и здоровье",
      "keywords": ["педиатр"],
      "exceptions": []
   },
   "Гастроэнтерология": {
      "category": "Медицина и здоровье",
      "keywords": [
         "пищевар",
         "пищевого",
         "нутриц",
         "гастроэнтерол", 
         "диетолог",
         "ожирен",
      ],
      "exceptions": []
   },
   "Диагностика": {
      "category": "Медицина и здоровье",
      "keywords": ["рентген", "мрт", "ультразвук", "скопи"],
      "exceptions": []
   },
   "Фармакология": {
      "category": "Медицина и здоровье",
      "keywords": ["фарма", "лекарств", ],
      "exceptions": []
   },
   

   # Компьютерная грамотность
   "MS Offiсe": {
      "category": "Компьютерная грамотность",
      "keywords": [
         "excel",
         "word", 
         "office",
         "power bi",
         "powerpoint",       
      ],
      "exceptions": []
   },
   
   
   # Бизнес и предпринимательство
   "Start-Up": {
      "category": "Бизнес и предпринимательство",
      "keywords": [
         "стартап", 
         "start-up",
      ],
      "exceptions": ["гидро"]
   },
   
   
   # Логистика
   
   
   # Строительство и недвижимость
   "Недвижимость": {
      "category": "Строительство и недвижимость",
      "keywords": [
         "недвиж"
         "девелоп",
      ],
      "exceptions": ["гидро"]
   },
   
   
   
   # Туризм и экскурсии
   "Гид": {
      "category": "Туризм и экскурсии",
      "keywords": ["гид"],
      "exceptions": ["гидро"]
   },
   
  

   #Охрана и безопасность
     
   
   # DIY и хобби
   "Рукоделие": {
      "category": "DIY и хобби",
      "keywords": [
         "рукодел", 
         "швей",
         "рукодел",
         "руками",
         "роспись",
         "кастомиз",
         "diy",
         "резьба",
        
      ],
      "exceptions": []
   },
   
   
   # Медиа и кинопроизводство
   "Сьемка": {
      "category": "Медиа и кинопроизводство",
      "keywords": [
         "фотограф",
         "видеосъемка",         
         ],
      "exceptions": []
   },
   "Музыка": {
      "category": "Медиа и кинопроизводство",
      "keywords": ["музыка"],
      "exceptions": []
   },
   
   
   # Физическая культура и спорт
   "Йога": {
      "category": "Физическая культура и спорт",
      "keywords": ["йог"],
      "exceptions": []
   },
   
   
   # Торговря и продажи
   "Переговоры": {
      "category": "Торговря и продажи",
      "keywords": [
         "перегов",
      ],
      "exceptions": []
   },
 
   
   # Наука

   "Гумманитарные науки": {
      "category": "Наука",
      "keywords": [
         "культуролог",
         "религиозных культур",
         "востоковед",
         "китаевед",
         "философ",
         "истор", "древн",
         "искусство",
         "искусства"
      ],
      "exceptions": ["управления", "оратор", "оценки", "бизнес", "речи", "договоров", ]
   },
   "Естественные науки": {
      "category": "Наука",
      "keywords": [
         "атом",
         "ядер",
         "квант",
         "кубсат",
         "галогенид",
         "квантовые",
         "космич",
         "стратосф",
         "микроскопия",
         "генно-инженер",
         "белковой химии",
         "рекомбинант",
         "очистки белков",
         "эмбриолог",
         "гидромет",
         "гидрогеолог",
         "гидропон",
         "химич"
      ],
      "exceptions": ["манга", "генеалогия", ]
   },



   # Рабочие профессии
    "Кулинария": {
      "category": "Рабочие профессии",
      "keywords": [
         "шеф",  
         "the meat",  
         "повар",  
      ],
      "exceptions": []
   },
    "Стройка": {
      "category": "Рабочие профессии",
      "keywords": [
         "геодез",
         "плотник",
         "каменщик",
         "моляр",

      ],
      "exceptions": []
   },
    "Кулинария": {
      "category": "Рабочие профессии",
      "keywords": [
         "шеф",  
         "the meat",  
         "повар",  
      ],
      "exceptions": []
   },

}
