CATEGORIES = {

   "Программирование и IT": {
      "keywords": [
         "программир",
         "python",
         "java",
         "javascript",
         "c++",
         "c#",
         "backend",
         "frontend",
         "webdev",
         "алгоритм",
         "разработ",
         "код",
         "dev",
         "1с",
         "qa",
         "тестир",
         "devops",
         "git",
         "api",
         "автоматиз",
         "сетевой",
         "системн",
         "инженери",
         " ит",
         "it",
         "цифровые",
         
         
      ],
      "exceptions": [
         "hr",
         "финанс",
         "бизнес",
         "медицинский",
         "травмой",
         "терапия",
         "культура",
         "француз",
         "facility",
         "territorial",
         "acquisition"
         
      ]
   },

   "Искусственный интеллект": {
      "keywords": [
         " ии ",
         "ии-",
         " ai ",
         "искусственный интеллект",
         "искусственному интеллекту",
         "искусственного интеллекта",
         "нейрос",
         "gpt",
         "llm",
         "машинн обуч",
         "machine learning",
         "ml",
         "deep learning",
         "генератив",
         "data science",
         "prompt",
         "вайб код",
         "вайб-код",
      ],
      "exceptions": ["врач", ]
   },

   "Аналитика": {
      "keywords": [
         "аналит",
         "data",
         "дашборд",
         "tableau",
         "power bi",
         "метрик",
         "unit эконом",
         "юнит эконом",
         "bi ",
      ],
      "exceptions": []
   },

   "Дизайн и творчество": {
      "keywords": [
         "дизайн",
         "ux",
         "ui",
         "figma",
         "графич",
         "типограф",
         "adobe",
         "шрифт",
         "иллюстр",
         "креатив",
         "худож",
         "коммуникацион дизайн",
         "фото",
         "видео",
      ],
      "exceptions": []
   },

   "3D и анимация": {
      "keywords": [
         "3d",
         "трехмер",
         "трёхмер",
         "cg",
         "cgi",
         "аним",
         "motion",
         "моушн",
         "vfx",
         "rig",
         "мульт",
         "blender",
         "maya",
         "houdini",
         "zbrush",
      ],
      "exceptions": []
   },

   "Маркетинг": {
      "keywords": [
         "маркетинг",
         "маркетп",
         "маркето",
         "smm",
         "seo",
         "бренд",
         "контент",
         "трафик",
         "таргет",
         "digital",
         "реклам",
         "продвиж",
         "копирайт",
         "медиакомм",
         
      ],
      "exceptions": ["автоматиз"]
   },

   "Менеджмент": {
      "keywords": [
         "менедж",
         "руковод",
         "директор",
         "управлен",
         "lead",
         "лидер",
         "mba",
         "executive",
         "project",
         "product",
         "scrum",
         "agile",
         "скрам",
         
      ],
      "exceptions": ["автоматиз"]
   },

   "Финансы и экономика": {
      "keywords": [
         "финанс",
         "эконом",
         "инвест",
         "банк",
         "бюджет",
         "бух",
         "казнач",
         "ipo",
         "фондов",
         "кредит",
         "тариф",
      ],
      "exceptions": []
   },

   "Налоги": {
      "keywords": [
         "налог",
         "tax",
         "фнс",
      ],
      "exceptions": []
   },

   "HR и управление персоналом": {
      "keywords": [
         "hr",
         "персонал",
         "кадр",
         "talent",
         "reward",
         "рекрут",
         "мотивац",
      ],
      "exceptions": []
   },

   "Soft Skills": {
      "keywords": [
         "коммуник",
         "переговор",
         "оратор",
         "выступл",
         "конфликт",
         "эмоц",
         "стресс",
         "тайм",
         "успех",
         "soft skill",
         "фасилитац",
         "критическ мышлен",
         "лидерств",
         "цели",
         "life",
         "мышление",
         "работодатели",
         "текстом",
         
      ],
      "exceptions": [
         "медиакоммун",
      ]
   },

   "Госуправление": {
      "keywords": [
         "гос",
         "муницип",
         "гражданск служб",
         "коррупц",
         "госуправ",
         "госпаблик",
         "власти",
         "нпа",
         "госслуж",
         "депутат",
      ],
      "exceptions": []
   },

   "Закупки и тендеры": {
      "keywords": [
         "закуп",
         "тендер",
         "44 фз",
         "223 фз",
         "госзаказ",
         "постав",
      ],
      "exceptions": []
   },

   "Юриспруденция": {
      "keywords": [
         "право",
         "юрист",
         "юрисп",
         "юридич"
         "адвокат",
         "договор",
         "compliance",
         "банкрот",
         "судеб",
         "контракт",
      ],
      "exceptions": [
         "управ",
      ]
   },

   "Педагогика": {
      "keywords": [
         "преподав",
         "педагог",
         "образов",
         "обучающ",
         "егэ",
         "учител",
         "обучен",
         "школ",
         "универс",
         "методист",
         "изучен",
         "обществознан",
         "дефектолог",
         
      ],
      "exceptions": ["excel", "оружием","имуществ", "разработка",
                     "теплоснабжения","ценообразован", "муниципальным" ]
   },

   "Языки и перевод": {
      "keywords": [
         "англий",
         "китай",
         "турец",
         "араб",
         "француз",
         "перевод",
         "язык",
         "language",
         "литерат",
         
      ],
      "exceptions": ["программи", "java", "право", ]
   },

   "Психология": {
      "keywords": [
         "психолог",
         "психоанализ",
         "терап",
         "эмоц",
         "травм",
         "сексолог",
         "психиатр",
      ],
      "exceptions": []
   },

   "Медицина и здоровье": {
      "keywords": [
         "медицин",
         "фарма",
         "здравоох",
         "реабилит",
         "клиник",
         "биомед",
         "генет",
         "нутриц",
         "хелс",
         "биопсия",
         "врач",
         "кров",
         "лечения",
         "иммунология",
      ],
      "exceptions": []
   },

   "Компьютерная грамотность": {
      "keywords": [
         "excel",
         "office",
         "word",
         "powerpoint",
         "компьют",
         "цифров грамот",
         "пк",
         "google docs",
         "google таблиц",
         "информационные технологии",
      ],
      "exceptions": []
   },

   "Бизнес и предпринимательство": {
      "keywords": [
         "бизнес",
         "предприним",
         "стартап",
         "коммерц",
         "ecommerce",
         "e commerce",
         "масштаб",
      ],
      "exceptions": []
   },

   "Логистика": {
      "keywords": [
         "логист",
         "цепями постав",
         "supply chain",
         "склад",
         "достав",
      ],
      "exceptions": []
   },

   "Строительство и недвижимость": {
      "keywords": [
         "строит",
         "девелоп",
         "недвиж",
         "facility",
         "bim",
         "архитект",
      ],
      "exceptions": []
   },

   "Туризм и экскурсии": {
      "keywords": [
         "туризм",
         "экскурс",
         "гид",
         "краевед",
      ],
      "exceptions": []
   },

   "Охрана и безопасность": {
      "keywords": [
         "охран",
         "оруж",
         "детектив",
         "гостайн",
         "государственн тайн",
         "чоп",
         "террор",
      ],
      "exceptions": []
   },

   "DIY и хобби": {
      "keywords": [
         "швей",
         "растен",
         "fdm",
         "3d печат",
         "рукодел",
         "craft",
         "diy",
         "руками",
      ],
      "exceptions": []
   },
   
   "Медиа и кинопроизводство": {
      "keywords": [
         "кино",
         "режиссер",
         "сценарист",
         "подкастинг",
         "публикационного",
   
      ],
      "exceptions": []
   },
   
   "Физическая культура и спорт": {
      "keywords": [
         "фитнес",
         "спорт",
            
      ],
      "exceptions": []
   },

   "Торговря и продажи": {
      "keywords": [
         "продаж",
         "торг",
         "селлер",
         "перегов"
      ],
      "exceptions": []
   },
   
   "Наука": {
      "keywords": [
         "химическ",
         "научных",
         "научного",
         "научно-произв",
         "научной",
         
         
      ],
      "exceptions": ["биохакинг"]
   },

}


SUBCATEGORIES = {
   "Python": {
      "category": "Программирование",
      "keywords": ["python", "python-"],
      "exceptions": []
   },
   "Кибербезопасность": {
      "category": "Программирование",
      "keywords": ["кибербезоп", "mitre"],
      "exceptions": []
   },
   "Информационная безопасность": {
      "category": "Программирование",
      "keywords": ["информационной безопасности",
                   "информационная безопасность",
                   ],
      "exceptions": []
   },
   "1С": {
      "category": "Программирование",
      "keywords": ["1с", "1 c", "1c", "1c-", "1с-"],
      "exceptions": []
   },
   "Frontend": {
      "category": "Программирование",
      "keywords": ["frontend", "react", "vue", "angular", "html",
                   " сайт",],
      "exceptions": []
   },
   "Backend": {
      "category": "Программирование",
      "keywords": ["backend", "django", "flask", "fastapi", "spring"],
      "exceptions": []
   },
   "SQL": {
      "category": "Программирование",
      "keywords": ["sql", "spring"],
      "exceptions": []
   },
   "Data Science": {
      "category": "Искусственный интеллект",
      "keywords": ["data science", "ml", "машинн обуч", "дата"],
      "exceptions": []
   },
   "Нейросети": {
      "category": "Искусственный интеллект",
      "keywords": ["нейрос", "gpt", "llm"],
      "exceptions": []
   },
   "3D-моделирование": {
      "category": "3D и анимация",
      "keywords": ["3d", "трехмер", "трёхмер", "blender", "maya", "zbrush", "cgi"],
      "exceptions": []
   },
   "Анимация": {
      "category": "3D и анимация",
      "keywords": ["аним", "motion", "моушн", "vfx"],
      "exceptions": []
   },
   "UX/UI": {
      "category": "Дизайн и творчество",
      "keywords": ["ux", "ui", "figma"],
      "exceptions": []
   },
   "Графический дизайн": {
      "category": "Дизайн и творчество",
      "keywords": ["графич", "типограф", "шрифт"],
      "exceptions": []
   },
   "Интернет-маркетинг": {
      "category": "Маркетинг",
      "keywords": ["smm", "seo", "таргет", "digital"],
      "exceptions": []
   },
   "Брендинг": {
      "category": "Маркетинг",
      "keywords": ["бренд"],
      "exceptions": []
   },
   "HR": {
      "category": "HR и управление персоналом",
      "keywords": ["hr", "персонал", "кадр"],
      "exceptions": []
   },
   "Проектный менеджмент": {
      "category": "Менеджмент",
      "keywords": ["project", "scrum", "agile", "проект"],
      "exceptions": []
   },
   "Продакт-менеджмент": {
      "category": "Менеджмент",
      "keywords": ["product", "продакт"],
      "exceptions": []
   },
   "Excel": {
      "category": "Компьютерная грамотность",
      "keywords": ["excel"],
      "exceptions": []
   },
   "Ораторское искусство": {
      "category": "Soft Skills",
      "keywords": ["оратор", "выступ", "реч", "спикер", 
                   "презентац", "переговор", ],
      "exceptions": [
         "дизайн"
      ]
   },
   "Тайм-менеджмент": {
      "category": "Soft Skills",
      "keywords": ["тайм", "стресс", "эмоц"],
      "exceptions": []
   },
   "Карьера": {
      "category": "Soft Skills",
      "keywords": ["карьер", "охотиться", "фриланс","призвания", "рофориенталог",
                   ],
      "exceptions": ["руководитель", "врача", "безопасности",
                     "научной", "центрами"]
   
   },
   "Закупки": {
      "category": "Закупки и тендеры",
      "keywords": ["закуп", "тендер", "44 фз", "223 фз"],
      "exceptions": []
   },
   "Госслужба": {
      "category": "Госуправление",
      "keywords": ["госслуж", "муницип", "госуправ"],
      "exceptions": []
   },
   "Налогообложение": {
      "category": "Налоги",
      "keywords": ["налог", "tax"],
      "exceptions": []
   },
   "Йога": {
      "category": "Физическая культура и спорт",
      "keywords": ["йог"],
      "exceptions": []
   },
}