CATEGORIES = {
   "Программирование и IT": {
      "keywords": [
         "программир",
         "javascript",
         "c++",
         "c#",
         "облачных сервисов",
         "webdev",
         "алгоритм",
         "разработ",
         "код",
         "unix",
         "dev",
         "1с",
         "5g",
         "автоматиз",
         "сетевой",
         "системн",
         "инженери",
         " ит",
         "it",
         "цифровые",
         "anylogic",
         "основы математики",     
         "информационных систем",     
         "библиотечные системы", 
      ],
      "exceptions": [
         "hr",
         "финанс",
         "бизнес",
         "медицинский",
         "травмой",
         "терапия",
         "культура",
         "француз",
         "facility",
         "territorial",
         "acquisition"
         
      ]
   },

   "Искусственный интеллект": {
      "keywords": [
         " ии",
         "ии-",
         " ai",
         "искусственный интеллект",
         "искусственному интеллекту",
         "искусственного интеллекта",
         "llm",
         "нейросет",
         "машинн обуч",
         "генератив",
         "data science",
         "вайб-код",
      ],
      "exceptions": []
   },

   "Data Science и аналитика": {
      "keywords": [
         "аналит",
         "data",
         "дашборд",
         "tableau",
         "power bi",
         "метрик",
         "инженер данных",
         "unit эконом",
         "юнит эконом",
         " bi",
         "Математика",
         "анализ данных",
         "анализе данных",
         "анализа данных",
         "базы данных",
         "база данных",
         "анализировать",
         "машинного обучения",
         "теория вероятностей",
      ],
      "exceptions": ["педагогич"]
   },

   "Дизайн": {
      "keywords": [
         "дизайн",
         "типограф",
         "арт‑дирекшн",
         "adobe",
         "шрифт",
         "креатив",
         "худож",
         "декор",
         "одежд",
         "инфограф",
         "стайлинг",
         "арт-дир",
      ],
      "exceptions": ["выступление", "демограф"]
   },

   "3D и анимация": {
      "keywords": [
         "3d",
         "трехмер",
         "трёхмер",
         "cg",
         "cgi",
         "аним",
         "motion",
         "моушн",
         "vfx",
         "rig",
         "мульт",
         "blender",
         "maya",
         "houdini",
         "zbrush",
         "рабочий график",
      ],
      "exceptions": []
   },

   "PR и маркетинг": {
      "keywords": [
         "маркетинг",
         "маркетп",
         "маркето",
         " pr ",
         "pr ",
         " pr",
         "трафик",
         "ранжирование",
         "реклам",
         "продвиж",
         "медиакомм",
         "молодежные",
         "информационная открытость",
         
      ],
      "exceptions": ["автоматиз"]
   },

   "Менеджмент": {
      "keywords": [
         "менедж",
         "защите информации",
         "управлен",
         "инклюзия в циф",
         "lead",
         "лидер",
         "триз",
         "показатели",
         "продюс",
         "трудовых споров",
         "деловых пис",
         "сервисных",
         "вовлеч",
         "комплаенс",
         "корпоративный",
         "организационное",
         
      ],
      "exceptions": ["автоматиз"]
   },

   "Финансы и экономика": {
      "keywords": [
         "финанс",
         "эконом",
         "банк",
         "бюджет",
         "казнач",
         "фондов",
         "кредит",
         "тариф",
         "стоимост",
         "платы",
         "международные",
         "международное",
         "международной",
         "международных",
         "стратегический анализ", 
         "анализ компаний", 
      ],
      "exceptions": ["mba"]
   },

   "HR и управление персоналом": {
      "keywords": [
         "hr",
         "персонал",
         "кадр",
         "talent",
         "reward",
         "рекрут",
         "мотивац",
      ],
      "exceptions": ["бренд", ]
   },

   "Soft Skills": {
      "keywords": [
         "коммуник",
         "конфликт",
         "успех",
         "личной эффективности",
         "повышения эффективности",
         "soft skill",
         "фасилитац",
         "критическ мышлен",
         "цели",
         "life",
         "мышление",
         "текстом",
         "нейролингв",
         "медиац",
         "медиат",
         "чтение",
         "фактчек",
         "блог",
         "этикет",
      ],
      "exceptions": ["медиакоммун",]
   },

   "Госуправление": {
      "keywords": [
         "госуд",
         "муницип",
         "теплоснабж",
         "гражданск служб",
         "коррупц",
         "госуправ",
         "госпаблик",
         "гражданской",
         "межконфессиональные",
         "власти",
         "нпа",
         "территориального развития",
         "электронного документооборота",
         "работы с населением ", 
         "работа с населением ", 
         "архивного дела",
         "госслуж",
         "природоресурсный",
         "урбанистика",
         "депутат",
         "преступность",
         "ценност",
         "многоквартирных",
         "расчет платы",
         "старение",
         "эффективный gr",
         "работы с молодежью",
         "грамотности населения",
      ],
      "exceptions": []
   },

   "Закупки и тендеры": {
      "keywords": [
         "закуп",
         "тендер",
         "фз",
         "фз",
         "госзаказ",
         "постав",
      ],
      "exceptions": []
   },
   
   "Стандартизация и метрология": {
      "keywords": [
         "соответств",
         "органолепт",
         "аттестац",
         "аудитор",
         "инспекц",
         "стандартных образцов",
         "метролог",
         "проб ",
         "калибровка средств",
         "пищевой продукции",
      ],
      "exceptions": []
   },

   "Юриспруденция и право": {
      "keywords": [
         "право",
         "права",
         "юрист",
         "страхов",
         "юрисп",
         "имуществ",
         "юридич"
         "адвокат",
         "преступления",
         "адвокатов",
         "оценочная деятельность",
         "арбитраж",
         "договор",
         "compliance",
         "нотар",
         "протокольн",
         "банкрот",
         "судеб",
         "интеллектуальная собственность",
         "нормативные акты",
         "делопроизводство",
         "контракт",
         "закона",
         "законо",
         "санкц",
         "экспертиза",
         "задолж",
         "юридических",
         "кадаст",
      ],
      "exceptions": ["управ", "психологич", 
      ]
   },

   "Педагогика": {
      "keywords": [
         "преподав",
         "педагог",
         "учебник",
         "образов",
         "обучающ",
         "обучен",
         "дошкол",
         "учебного",
         "методист",
         "изучен",
         "обществознан",
         "проблемы этики",
         
      ],
      "exceptions": ["excel", "оружием","имуществ", "разработка",
                     "теплоснабжения","ценообразован", "муниципальным", "машинное"]
   },

   "Филалогия": {
      "keywords": [
         "перевод",
         "язык",
         "language",
         
      ],
      "exceptions": ["программи", "java", "право", ]
   },

   "Психология": {
      "keywords": [
         "психол",
         "психоанализ",
         "сексолог",
         "нарцис",
         "полиграф",
         "гармони",
         "супружеской",
         "манипуляции", 
         " кст",
         "люб",
      ],
      "exceptions": []
   },

   "Медицина и здоровье": {
      "keywords": [
         "медицин",
         "клинич",
         "пациент",
         "фарма",
         "лекарств",
         "здравоох",
         "пищевар",
         "здоров",
         "реабилит",   
         "рентген",
         "операционное дело",
         "поражен",
         "заболева",
         "уродинам",
         "резекц",
         "патолог",
         "пищевого",
         "избранные вопросы",
         "актуальные вопросы",
         "клиник",
         "биомед",
         "генет",
         "нутриц",
         "психофиз",
         "хелс",
         "нефролитотрип",            
         "лечение",
         "гастроэнтерология", 
         "остеопат", 
         "гинекол", 
         "эндо",
         "аллерг",
         "коррекционные",
         "врач",
         "лечения",
         "иммунолог",
         "психопатол",
         "эстетист",
         "первой помощи",
         "диетолог",
         "гастро",
         "ожирен",
      ],
      "exceptions": ["талантов"]
   },

   "Компьютерная грамотность": {
      "keywords": [
         "excel", "word", "office","компьют", "таблиц", "powerpoint",
         "цифров грамот", "google docs", "google таблиц", "цифровая грамотност",
         "информационные технологии",
      ],
      "exceptions": []
   },

   "Бизнес и предпринимательство": {
      "keywords": [
         "бизнес", 
         "предприним", 
         "стартап", 
         "коммерц", 
         "масштаб", 
         "двойник", 
         "mba",
         "от гипотезы к рынку",
      ],
      "exceptions": []
   },

   "Логистика": {
      "keywords": [
         "логист", 
         "трансфертн",
         "постав",
         "supply chain",
         "склад",
         "достав",
         "тамож",
      ],
      "exceptions": ["соответствия"]
   },

   "Строительство и недвижимость": {
      "keywords": [
         "строит", 
         "девелоп",
         "недвиж",
         "facility",
         "bim",
         "архитект",
         "renga",           
         "газораспределения", 
         "теплогазоснабжение", 
         "электроэнергетика", 
         "вентиляц", 
         "дорог", 
         "стройконтроль", 
      ],
      "exceptions": []
   },

   "Туризм и экскурсии": {
      "keywords": [
         "туризм",
         "экскурс",
         "гид",
         "краевед",
      ],
      "exceptions": []
   },

   "Охрана и безопасность": {
      "keywords": [
         "охран",
         "оруж",
         "детектив",
         "гостайн",
         "государственн тайн",
         "чоп",
         "террор",  
         "аварийност",  
         "радиац",  
         "экологической безопасности",  
         "экологическая безопасности",  
         "оператор беспилотного",  
         "приказ 117",  
      ],
      "exceptions": []
   },

   "Искусство и творчество": {
         "keywords": [
            "искусство",
            "искусства",
            "искусств ",
            "творчество",
            "творческим экзаменам",
         ],
         "exceptions": ["управления", "оратор", "оценки", "бизнес", "речи", "договоров", ]
      },

   "DIY и хобби": {
      "keywords": [
         "швей",
         "растен",
         "fdm",
         "3d печат",
         "цветоч",
         "рукодел",
         "кастомиз",
         "резьба",
         "эпоксид",
         "craft",
         "diy",
         "Валяние шерсти",
         "руками",
         "роспись",
         "манга",
         "дидже",
         "генеалог",
      ],
      "exceptions": []
   },
   
   "Медиа и кинопроизводство": {
      "keywords": [
         "кино",
         "режиссер",
         "сценарист",
         "подкаст",
         "журналистика",
         "публикационного",
         "видеосъемка",
         "продакшн",
         "телеведущий",
   
      ],
      "exceptions": ["музыкальные", ]
   },
   
   "Физическая культура и спорт": {
      "keywords": [
         "спорт",
         "фитнес",
         "физическая культура"
      ],
      "exceptions": ["нефти", "транспорт"]
   },

   "Торговря и продажи": {
      "keywords": [
         "продаж",
         "торг",
         "селлер",
         "перегов",
         "сбыт"
      ],
      "exceptions": []
   },
   
   "Наука": {
      "keywords": [
         "химическ",
         "научных",
         "науки",
         "науке",
         "атом",
         "ядер",
         "квант",
         "научного",
         "культуролог",
         "религиозных культур",
         "научно-произв",
         "академическое",
         "научно-тех",
         "научной",
         "кубсат",
         "галогенид",
         "квантовые",
         "космич",
         "стратосф",
         "востоковед",
         "китаевед",
         "микроскопия",
         "генно-инженер",
         "белковой химии",
         "рекомбинант",
         "очистки белков",
         "гистологич",
         "археологич",
         "метаболом",
         "cтатистический анализ",
         "эмбриолог",
         
      ],
      "exceptions": ["биохакинг"]
   },
   
   "Рабочие профессии": {
      "keywords": [
         "водител",
         "моляр",
         "реставрац",
         "обслуживание",
         "слесарь",
         "эколог ",
         "экология ",
         "обслуживание",
         "геодез",
         "плотник",
         "каменщик",
         "разряд",  
         "повар",  
         "the meat",  
         "the meat",  
         "паназия",
         "шеф",  
         "судов",
         "лоцман",
         "швартовных",
         "ремонт электрооборудования",
         "пожар",
         "нефтегаз",
         " производство",
         "беспилотных",
         "бармен",
         "инженерно-техническое",
         "сборщик",
         "дезинфек",
      ],
      "exceptions": ["биохакинг", "руковододит",]
   },
   
   "Другое": {
      "keywords": [
         "пробный урок",
         "глобальном мире",
         "внешнеполит",
         "исследования скважин",
         "трудноизвлекаемых",
         "планировка квартиры",
         "proвино",
      ],
      "exceptions": []
   },

}


SUBCATEGORIES = {
   
   # Программирование и IT
   "Python": {
      "category": "Программирование и IT",
      "keywords": ["python", "питон"],
      "exceptions": []
   },
   "Java": {
      "category": "Программирование и IT",
      "keywords": ["java", "джава"],
      "exceptions": []
   },
   "Кибербезопасность": {
      "category": "Программирование и IT",
      "keywords": ["кибербезоп", "mitre","информационной безопасности", "информационная безопасность", "сетевая безопасность"],
      "exceptions": []
   },
   "1С": {
      "category": "Программирование и IT",
      "keywords": ["1с", "1 c", "1c", "1c-", "1с-"],
      "exceptions": []
   },
   "Frontend": {
      "category": "Программирование и IT",
      "keywords": ["frontend", "react", "vue", "angular", "html",
                   " сайт",],
      "exceptions": []
   },
   "Backend": {
      "category": "Программирование и IT",
      "keywords": ["backend", "django", "flask", "fastapi", "spring"],
      "exceptions": []
   },
   "SQL": {
      "category": "Программирование и IT",
      "keywords": ["sql", "spring"],
      "exceptions": []
   },
   "Go": {
      "category": "Программирование и IT",
      "keywords": ["go" ],
      "exceptions": ["язык", "django"]
   },
   "DevOps": {
      "category": "Программирование и IT",
      "keywords": ["devops", "sre ", "git"],
      "exceptions": []
   },
   "QA и тестирование": {
      "category": "Программирование и IT",
      "keywords": ["qa", "тестир"],
      "exceptions": []
   },
   "Data Science": {
      "category": "Искусственный интеллект",
      "keywords": ["data science", "ml", "машинн обуч", "дата"],
      "exceptions": []
   },
   
   
   # Искусственный интеллект 
   "Машинное обучение": {
      "category": "Искусственный интеллект",
      "keywords": ["машинное", "ml", "deep learning",  ],
      "exceptions": ["html", ]
   },
   
   
   # Data Science и аналитика
   
   
   # Дизайн
   "UX/UI": {
      "category": "Дизайн",
      "keywords": ["ux", "ui", "figma"],
      "exceptions": []
   },
   "Графический дизайн": {
      "category": "Дизайн",
      "keywords": ["графич", "типограф", "шрифт", "иллюстр","график",],
      "exceptions": []
   },
   
   
   # 3D и анимация
   "3D-моделирование": {
      "category": "3D и анимация",
      "keywords": ["3d", "трехмер", "трёхмер", "blender",
                   "maya", "zbrush", "cgi", "nanocad"],
      "exceptions": []
   },
   "Анимация": {
      "category": "3D и анимация",
      "keywords": ["аним", "motion", "моушн", "vfx"],
      "exceptions": []
   },
   
   
   # PR и маркетинг
   "Интернет-маркетинг": {
      "category": "PR и маркетинг",
      "keywords": ["smm", "seo", "таргет", "digital"],
      "exceptions": []
   },
   "Брендинг": {
      "category": "PR и маркетинг",
      "keywords": ["бренд"],
      "exceptions": []
   },
   "Копирайтинг и контент": {
      "category": "PR и маркетинг",
      "keywords": ["контент", "копирайт",],
      "exceptions": []
   },
   
     
   # Менеджмент
   "Проектный менеджмент": {
      "category": "Менеджмент",
      "keywords": ["project", "scrum", "скрам", "agile", "проект"],
      "exceptions": []
   },
   "Продакт-менеджмент": {
      "category": "Менеджмент",
      "keywords": ["product", "продакт"],
      "exceptions": []
   },
   "MBA": {
      "category": "Менеджмент",
      "keywords": ["mba", "мва", "executive"],
      "exceptions": []
   },
   "Лидерство": {
      "category": "Менеджмент",
      "keywords": ["лидер"],
      "exceptions": []
   },
   "Управление людьми": {
      "category": "Менеджмент",
      "keywords": ["директор","руковод", "заведущ", "управляющ", "эффективности команды", ],
      "exceptions": []
   },
   
   
   # Финансы и экономика
   "Налоги": {
      "category": "Финансы и экономика",
      "keywords": [
         "налог",
         "tax",
         "фнс",
         "задолж",
      ],
      "exceptions": []
   },
   "Инвестиции": {
      "category": "Финансы и экономика",
      "keywords": [
         "инвест",
         "ipo",
         "ценных бумаг",
         "оценка рынка",
      ],
      "exceptions": []
   },
   "Бухгалтерия": {
      "category": "Финансы и экономика",
      "keywords": ["бухг"],
      "exceptions": []
   },
   
   
   # HR и управление персоналом
   "HR": {
      "category": "HR и управление персоналом",
      "keywords": ["hr", "персонал"],
      "exceptions": []
   },
   
   
    # Soft Skills
   
   
   # Soft Skills
   "Ораторское искусство": {
      "category": "Soft Skills",
      "keywords": ["оратор", "выступ", "реч", "спикер", "презентац", "переговор"],
      "exceptions": ["дизайн", "лаборат"]
   },
   "Тайм-менеджмент": {
      "category": "Soft Skills",
      "keywords": ["тайм", "стресс", "эмоц"],
      "exceptions": []
   },
   "Карьера": {
      "category": "Soft Skills",
      "keywords": [
         "карьер", 
         "охотиться", 
         "фриланс",
         "призвания",     
         "рофориенталог", 
         "старт работы", 
         "резюме", 
         "профориентац", 
         "какую профессию"
         "работодатели",

      ],
      "exceptions": ["руководитель", "врача", "безопасности", "научной", "центрами"]
   },
   "Коучинг": {
      "category": "Soft Skills",
      "keywords": ["коуч"],
      "exceptions": ["бизнес", "хелс", "иностранных", "центрами"]
   },
   
   
   # Госуправление
   
   
   # Закупки и тендеры
   "Закупки": {
      "category": "Закупки и тендеры",
      "keywords": ["закуп", "тендер", "фз"],
      "exceptions": []
   },
   
   
   # Стандартизация и метрология
   
   
   # Юриспруденция и право
   
   
   # Педагогика
   "Подготовка к ОГЭ и ЕГЭ": {
      "category": "Педагогика",
      "keywords": ["егэ", "огэ"],
      "exceptions": []
   },
   "Дошкольное и детское образование": {
      "category": "Педагогика",
      "keywords": ["работе с детьми", "работы с детьми", "работа с детьми", "дефектолог", "логопед", "звукопроизношения", "вожат" "дошкольн"],
      "exceptions": []
   },
   "Школьное образование": {
      "category": "Педагогика",
      "keywords": ["школьник", "учител", "социализацию детей", "средней школе", 
],
      "exceptions": []
   },
   "Высшее образование": {
      "category": "Педагогика",
      "keywords": ["универс", "абитуриент"],
      "exceptions": []
   },
   
   
   # Филология
   "Языки и перевод": {
      "category": "Филалогия",
      "keywords": [
         "англий",
         "китай",
         "турец",
         "араб",
         "француз",
         "русски",
         "gmat",
         "сст ",
         "toefl",
         "трки",
         "иностранных граждан",
      ],
      "exceptions": ["право", "бизнес"]
   },
   "Литература": {
      "category": "Филалогия",
      "keywords": [
         "литерат",
         "писат",

      ],
      "exceptions": ["право",]
   },

   
   # Психология
   "Психотерапия": {
      "category": "Психология",
      "keywords": ["терап", "травм", "группового анализа", "миланском подходе", "оркт"],
      "exceptions": []
   },
   "Клиническая психология": {
      "category": "Психология",
      "keywords": ["психопатол", "суицид", "психиатр", "профайлинг"],
      "exceptions": []
   },
 
   
   # Медицина и здоровье
   "Хирургия": {
      "category": "Медицина и здоровье",
      "keywords": ["хирург", "резекц", "операционное дело"],
      "exceptions": []
   },
   "Кардиология": {
      "category": "Медицина и здоровье",
      "keywords": ["серд", "кардио", "кров"],
      "exceptions": []
   },
   "Онкология": {
      "category": "Медицина и здоровье",
      "keywords": ["онколог", "биопсия"],
      "exceptions": []
   },
   "Педиатрия": {
      "category": "Медицина и здоровье",
      "keywords": ["педиатр"],
      "exceptions": []
   },
   "Диагностика": {
      "category": "Медицина и здоровье",
      "keywords": ["рентген", "мрт", "ультразвук", "скоп"],
      "exceptions": []
   },
   

   # Компьютерная грамотность
   "Excel": {
      "category": "Компьютерная грамотность",
      "keywords": ["excel"],
      "exceptions": []
   },
   
   
   # Бизнес и предпринимательство
   
   
   # Логистика
   
   
   # Строительство и недвижимость
   
   
   # Туризм и экскурсии
   
   
   # Госуправление
   "Госслужба": {
      "category": "Госуправление",
      "keywords": ["госслуж", "муницип", "госуправ"],
      "exceptions": []
   },
   

   #Охрана и безопасность
   
   
   # Искусство и творчество
   
   
   # DIY и хобби
   
   
   # Медиа и кинопроизводство
   "Фотография": {
      "category": "Медиа и кинопроизводство",
      "keywords": ["фотограф"],
      "exceptions": []
   },
   "Музыка": {
      "category": "Медиа и кинопроизводство",
      "keywords": ["музыка"],
      "exceptions": []
   },
   
   
   # Физическая культура и спорт
   "Йога": {
      "category": "Физическая культура и спорт",
      "keywords": ["йог"],
      "exceptions": []
   },
   
   
   # Торговря и продажи
   
   
   # Наука
   "Философия": {
      "category": "Наука",
      "keywords": ["философ"],
      "exceptions": ["предпринимат", ]
   },
   "История": {
      "category": "Наука",
      "keywords": ["истор", "древн"],
      "exceptions": ["манга", "генеалогия", ]
   },


   # Рабочие профессии

}
